#include "led.h"
/**************************************************************************
函数功能：LED接口初始化
入口参数：无 
返回  值：无
**************************************************************************/
void LED_Init(void)
{
RCC->APB2ENR|=1<<4; //使能 PORTA 时钟  
GPIOC->CRH&=0XFF0FFFFF;
GPIOC->CRH|=0X00300000;//PA12 推挽输出
GPIOC->ODR|=1<<13; //PA12 输出高
}

/**************************************************************************
函数功能：LED闪烁
入口参数：闪烁频率 
返回  值：无
**************************************************************************/
void Led_Flash(u16 time)
{
	  static int temp;
	  if(0==time) LED=0;
	  else		if(++temp==time)	LED=~LED,temp=0;
}
